{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "data", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 128, 128, 3], "dtype": "float32", "sparse": false, "name": "data"}, "inbound_nodes": []}, {"name": "conv1_zeropadding", "class_name": "ZeroPadding2D", "config": {"name": "conv1_zeropadding", "trainable": true, "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "inbound_nodes": [[["data", 0, 0, {}]]]}, {"name": "conv1", "class_name": "Conv2D", "config": {"name": "conv1", "trainable": true, "filters": 64, "kernel_size": [7, 7], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1_zeropadding", 0, 0, {}]]]}, {"name": "conv1_bn", "class_name": "BatchNormalization", "config": {"name": "conv1_bn", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 1.1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"name": "conv1_scale", "class_name": "Scale", "config": {"name": "conv1_scale", "trainable": true, "momentum": 0.9, "axis": 3}, "inbound_nodes": [[["conv1_bn", 0, 0, {}]]]}, {"name": "relu1", "class_name": "Activation", "config": {"name": "relu1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv1_scale", 0, 0, {}]]]}, {"name": "pool1_zeropadding", "class_name": "ZeroPadding2D", "config": {"name": "pool1_zeropadding", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["relu1", 0, 0, {}]]]}, {"name": "pool1", "class_name": "MaxPooling2D", "config": {"name": "pool1", "trainable": true, "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["pool1_zeropadding", 0, 0, {}]]]}, {"name": "conv2_1_x1_bn", "class_name": "BatchNormalization", "config": {"name": "conv2_1_x1_bn", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 1.1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["pool1", 0, 0, {}]]]}, {"name": "conv2_1_x1_scale", "class_name": "Scale", "config": {"name": "conv2_1_x1_scale", "trainable": true, "momentum": 0.9, "axis": 3}, "inbound_nodes": [[["conv2_1_x1_bn", 0, 0, {}]]]}, {"name": "relu2_1_x1", "class_name": "Activation", "config": {"name": "relu2_1_x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2_1_x1_scale", 0, 0, {}]]]}, {"name": "conv2_1_x1", "class_name": "Conv2D", "config": {"name": "conv2_1_x1", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["relu2_1_x1", 0, 0, {}]]]}, {"name": "conv2_1_x2_bn", "class_name": "BatchNormalization", "config": {"name": "conv2_1_x2_bn", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 1.1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2_1_x1", 0, 0, {}]]]}, {"name": "conv2_1_x2_scale", "class_name": "Scale", "config": {"name": "conv2_1_x2_scale", "trainable": true, "momentum": 0.9, "axis": 3}, "inbound_nodes": [[["conv2_1_x2_bn", 0, 0, {}]]]}, {"name": "relu2_1_x2", "class_name": "Activation", "config": {"name": "relu2_1_x2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2_1_x2_scale", 0, 0, {}]]]}, {"name": "conv2_1_x2_zeropadding", "class_name": "ZeroPadding2D", "config": {"name": "conv2_1_x2_zeropadding", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["relu2_1_x2", 0, 0, {}]]]}, {"name": "conv2_1_x2", "class_name": "Conv2D", "config": {"name": "conv2_1_x2", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2_1_x2_zeropadding", 0, 0, {}]]]}, {"name": "concat_2_1", "class_name": "Concatenate", "config": {"name": "concat_2_1", "trainable": true, "axis": 3}, "inbound_nodes": [[["pool1", 0, 0, {}], ["conv2_1_x2", 0, 0, {}]]]}, {"name": "conv2_2_x1_bn", "class_name": "BatchNormalization", "config": {"name": "conv2_2_x1_bn", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 1.1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concat_2_1", 0, 0, {}]]]}, {"name": "conv2_2_x1_scale", "class_name": "Scale", "config": {"name": "conv2_2_x1_scale", "trainable": true, "momentum": 0.9, "axis": 3}, "inbound_nodes": [[["conv2_2_x1_bn", 0, 0, {}]]]}, {"name": "relu2_2_x1", "class_name": "Activation", "config": {"name": "relu2_2_x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2_2_x1_scale", 0, 0, {}]]]}, {"name": "conv2_2_x1", "class_name": "Conv2D", "config": {"name": "conv2_2_x1", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["relu2_2_x1", 0, 0, {}]]]}, {"name": "conv2_2_x2_bn", "class_name": "BatchNormalization", "config": {"name": "conv2_2_x2_bn", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 1.1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2_2_x1", 0, 0, {}]]]}, {"name": "conv2_2_x2_scale", "class_name": "Scale", "config": {"name": "conv2_2_x2_scale", "trainable": true, "momentum": 0.9, "axis": 3}, "inbound_nodes": [[["conv2_2_x2_bn", 0, 0, {}]]]}, {"name": "relu2_2_x2", "class_name": "Activation", "config": {"name": "relu2_2_x2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2_2_x2_scale", 0, 0, {}]]]}, {"name": "conv2_2_x2_zeropadding", "class_name": "ZeroPadding2D", "config": {"name": "conv2_2_x2_zeropadding", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["relu2_2_x2", 0, 0, {}]]]}, {"name": "conv2_2_x2", "class_name": "Conv2D", "config": {"name": "conv2_2_x2", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2_2_x2_zeropadding", 0, 0, {}]]]}, {"name": "concat_2_2", "class_name": "Concatenate", "config": {"name": "concat_2_2", "trainable": true, "axis": 3}, "inbound_nodes": [[["concat_2_1", 0, 0, {}], ["conv2_2_x2", 0, 0, {}]]]}, {"name": "conv2_3_x1_bn", "class_name": "BatchNormalization", "config": {"name": "conv2_3_x1_bn", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 1.1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concat_2_2", 0, 0, {}]]]}, {"name": "conv2_3_x1_scale", "class_name": "Scale", "config": {"name": "conv2_3_x1_scale", "trainable": true, "momentum": 0.9, "axis": 3}, "inbound_nodes": [[["conv2_3_x1_bn", 0, 0, {}]]]}, {"name": "relu2_3_x1", "class_name": "Activation", "config": {"name": "relu2_3_x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2_3_x1_scale", 0, 0, {}]]]}, {"name": "conv2_3_x1", "class_name": "Conv2D", "config": {"name": "conv2_3_x1", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["relu2_3_x1", 0, 0, {}]]]}, {"name": "conv2_3_x2_bn", "class_name": "BatchNormalization", "config": {"name": "conv2_3_x2_bn", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 1.1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2_3_x1", 0, 0, {}]]]}, {"name": "conv2_3_x2_scale", "class_name": "Scale", "config": {"name": "conv2_3_x2_scale", "trainable": true, "momentum": 0.9, "axis": 3}, "inbound_nodes": [[["conv2_3_x2_bn", 0, 0, {}]]]}, {"name": "relu2_3_x2", "class_name": "Activation", "config": {"name": "relu2_3_x2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2_3_x2_scale", 0, 0, {}]]]}, {"name": "conv2_3_x2_zeropadding", "class_name": "ZeroPadding2D", "config": {"name": "conv2_3_x2_zeropadding", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["relu2_3_x2", 0, 0, {}]]]}, {"name": "conv2_3_x2", "class_name": "Conv2D", "config": {"name": "conv2_3_x2", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2_3_x2_zeropadding", 0, 0, {}]]]}, {"name": "concat_2_3", "class_name": "Concatenate", "config": {"name": "concat_2_3", "trainable": true, "axis": 3}, "inbound_nodes": [[["concat_2_2", 0, 0, {}], ["conv2_3_x2", 0, 0, {}]]]}, {"name": "conv2_4_x1_bn", "class_name": "BatchNormalization", "config": {"name": "conv2_4_x1_bn", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 1.1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concat_2_3", 0, 0, {}]]]}, {"name": "conv2_4_x1_scale", "class_name": "Scale", "config": {"name": "conv2_4_x1_scale", "trainable": true, "momentum": 0.9, "axis": 3}, "inbound_nodes": [[["conv2_4_x1_bn", 0, 0, {}]]]}, {"name": "relu2_4_x1", "class_name": "Activation", "config": {"name": "relu2_4_x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2_4_x1_scale", 0, 0, {}]]]}, {"name": "conv2_4_x1", "class_name": "Conv2D", "config": {"name": "conv2_4_x1", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["relu2_4_x1", 0, 0, {}]]]}, {"name": "conv2_4_x2_bn", "class_name": "BatchNormalization", "config": {"name": "conv2_4_x2_bn", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 1.1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2_4_x1", 0, 0, {}]]]}, {"name": "conv2_4_x2_scale", "class_name": "Scale", "config": {"name": "conv2_4_x2_scale", "trainable": true, "momentum": 0.9, "axis": 3}, "inbound_nodes": [[["conv2_4_x2_bn", 0, 0, {}]]]}, {"name": "relu2_4_x2", "class_name": "Activation", "config": {"name": "relu2_4_x2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2_4_x2_scale", 0, 0, {}]]]}, {"name": "conv2_4_x2_zeropadding", "class_name": "ZeroPadding2D", "config": {"name": "conv2_4_x2_zeropadding", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["relu2_4_x2", 0, 0, {}]]]}, {"name": "conv2_4_x2", "class_name": "Conv2D", "config": {"name": "conv2_4_x2", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2_4_x2_zeropadding", 0, 0, {}]]]}, {"name": "concat_2_4", "class_name": "Concatenate", "config": {"name": "concat_2_4", "trainable": true, "axis": 3}, "inbound_nodes": [[["concat_2_3", 0, 0, {}], ["conv2_4_x2", 0, 0, {}]]]}, {"name": "conv2_5_x1_bn", "class_name": "BatchNormalization", "config": {"name": "conv2_5_x1_bn", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 1.1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concat_2_4", 0, 0, {}]]]}, {"name": "conv2_5_x1_scale", "class_name": "Scale", "config": {"name": "conv2_5_x1_scale", "trainable": true, "momentum": 0.9, "axis": 3}, "inbound_nodes": [[["conv2_5_x1_bn", 0, 0, {}]]]}, {"name": "relu2_5_x1", "class_name": "Activation", "config": {"name": "relu2_5_x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2_5_x1_scale", 0, 0, {}]]]}, {"name": "conv2_5_x1", "class_name": "Conv2D", "config": {"name": "conv2_5_x1", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["relu2_5_x1", 0, 0, {}]]]}, {"name": "conv2_5_x2_bn", "class_name": "BatchNormalization", "config": {"name": "conv2_5_x2_bn", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 1.1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2_5_x1", 0, 0, {}]]]}, {"name": "conv2_5_x2_scale", "class_name": "Scale", "config": {"name": "conv2_5_x2_scale", "trainable": true, "momentum": 0.9, "axis": 3}, "inbound_nodes": [[["conv2_5_x2_bn", 0, 0, {}]]]}, {"name": "relu2_5_x2", "class_name": "Activation", "config": {"name": "relu2_5_x2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2_5_x2_scale", 0, 0, {}]]]}, {"name": "conv2_5_x2_zeropadding", "class_name": "ZeroPadding2D", "config": {"name": "conv2_5_x2_zeropadding", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["relu2_5_x2", 0, 0, {}]]]}, {"name": "conv2_5_x2", "class_name": "Conv2D", "config": {"name": "conv2_5_x2", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2_5_x2_zeropadding", 0, 0, {}]]]}, {"name": "concat_2_5", "class_name": "Concatenate", "config": {"name": "concat_2_5", "trainable": true, "axis": 3}, "inbound_nodes": [[["concat_2_4", 0, 0, {}], ["conv2_5_x2", 0, 0, {}]]]}, {"name": "conv2_6_x1_bn", "class_name": "BatchNormalization", "config": {"name": "conv2_6_x1_bn", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 1.1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concat_2_5", 0, 0, {}]]]}, {"name": "conv2_6_x1_scale", "class_name": "Scale", "config": {"name": "conv2_6_x1_scale", "trainable": true, "momentum": 0.9, "axis": 3}, "inbound_nodes": [[["conv2_6_x1_bn", 0, 0, {}]]]}, {"name": "relu2_6_x1", "class_name": "Activation", "config": {"name": "relu2_6_x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2_6_x1_scale", 0, 0, {}]]]}, {"name": "conv2_6_x1", "class_name": "Conv2D", "config": {"name": "conv2_6_x1", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["relu2_6_x1", 0, 0, {}]]]}, {"name": "conv2_6_x2_bn", "class_name": "BatchNormalization", "config": {"name": "conv2_6_x2_bn", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 1.1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2_6_x1", 0, 0, {}]]]}, {"name": "conv2_6_x2_scale", "class_name": "Scale", "config": {"name": "conv2_6_x2_scale", "trainable": true, "momentum": 0.9, "axis": 3}, "inbound_nodes": [[["conv2_6_x2_bn", 0, 0, {}]]]}, {"name": "relu2_6_x2", "class_name": "Activation", "config": {"name": "relu2_6_x2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2_6_x2_scale", 0, 0, {}]]]}, {"name": "conv2_6_x2_zeropadding", "class_name": "ZeroPadding2D", "config": {"name": "conv2_6_x2_zeropadding", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["relu2_6_x2", 0, 0, {}]]]}, {"name": "conv2_6_x2", "class_name": "Conv2D", "config": {"name": "conv2_6_x2", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2_6_x2_zeropadding", 0, 0, {}]]]}, {"name": "concat_2_6", "class_name": "Concatenate", "config": {"name": "concat_2_6", "trainable": true, "axis": 3}, "inbound_nodes": [[["concat_2_5", 0, 0, {}], ["conv2_6_x2", 0, 0, {}]]]}, {"name": "conv2_blk_bn", "class_name": "BatchNormalization", "config": {"name": "conv2_blk_bn", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 1.1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concat_2_6", 0, 0, {}]]]}, {"name": "conv2_blk_scale", "class_name": "Scale", "config": {"name": "conv2_blk_scale", "trainable": true, "momentum": 0.9, "axis": 3}, "inbound_nodes": [[["conv2_blk_bn", 0, 0, {}]]]}, {"name": "relu2_blk", "class_name": "Activation", "config": {"name": "relu2_blk", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2_blk_scale", 0, 0, {}]]]}, {"name": "conv2_blk", "class_name": "Conv2D", "config": {"name": "conv2_blk", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["relu2_blk", 0, 0, {}]]]}, {"name": "pool2", "class_name": "AveragePooling2D", "config": {"name": "pool2", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2_blk", 0, 0, {}]]]}, {"name": "conv3_1_x1_bn", "class_name": "BatchNormalization", "config": {"name": "conv3_1_x1_bn", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 1.1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["pool2", 0, 0, {}]]]}, {"name": "conv3_1_x1_scale", "class_name": "Scale", "config": {"name": "conv3_1_x1_scale", "trainable": true, "momentum": 0.9, "axis": 3}, "inbound_nodes": [[["conv3_1_x1_bn", 0, 0, {}]]]}, {"name": "relu3_1_x1", "class_name": "Activation", "config": {"name": "relu3_1_x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv3_1_x1_scale", 0, 0, {}]]]}, {"name": "conv3_1_x1", "class_name": "Conv2D", "config": {"name": "conv3_1_x1", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["relu3_1_x1", 0, 0, {}]]]}, {"name": "conv3_1_x2_bn", "class_name": "BatchNormalization", "config": {"name": "conv3_1_x2_bn", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 1.1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3_1_x1", 0, 0, {}]]]}, {"name": "conv3_1_x2_scale", "class_name": "Scale", "config": {"name": "conv3_1_x2_scale", "trainable": true, "momentum": 0.9, "axis": 3}, "inbound_nodes": [[["conv3_1_x2_bn", 0, 0, {}]]]}, {"name": "relu3_1_x2", "class_name": "Activation", "config": {"name": "relu3_1_x2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv3_1_x2_scale", 0, 0, {}]]]}, {"name": "conv3_1_x2_zeropadding", "class_name": "ZeroPadding2D", "config": {"name": "conv3_1_x2_zeropadding", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["relu3_1_x2", 0, 0, {}]]]}, {"name": "conv3_1_x2", "class_name": "Conv2D", "config": {"name": "conv3_1_x2", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv3_1_x2_zeropadding", 0, 0, {}]]]}, {"name": "concat_3_1", "class_name": "Concatenate", "config": {"name": "concat_3_1", "trainable": true, "axis": 3}, "inbound_nodes": [[["pool2", 0, 0, {}], ["conv3_1_x2", 0, 0, {}]]]}, {"name": "conv3_2_x1_bn", "class_name": "BatchNormalization", "config": {"name": "conv3_2_x1_bn", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 1.1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concat_3_1", 0, 0, {}]]]}, {"name": "conv3_2_x1_scale", "class_name": "Scale", "config": {"name": "conv3_2_x1_scale", "trainable": true, "momentum": 0.9, "axis": 3}, "inbound_nodes": [[["conv3_2_x1_bn", 0, 0, {}]]]}, {"name": "relu3_2_x1", "class_name": "Activation", "config": {"name": "relu3_2_x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv3_2_x1_scale", 0, 0, {}]]]}, {"name": "conv3_2_x1", "class_name": "Conv2D", "config": {"name": "conv3_2_x1", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["relu3_2_x1", 0, 0, {}]]]}, {"name": "conv3_2_x2_bn", "class_name": "BatchNormalization", "config": {"name": "conv3_2_x2_bn", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 1.1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3_2_x1", 0, 0, {}]]]}, {"name": "conv3_2_x2_scale", "class_name": "Scale", "config": {"name": "conv3_2_x2_scale", "trainable": true, "momentum": 0.9, "axis": 3}, "inbound_nodes": [[["conv3_2_x2_bn", 0, 0, {}]]]}, {"name": "relu3_2_x2", "class_name": "Activation", "config": {"name": "relu3_2_x2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv3_2_x2_scale", 0, 0, {}]]]}, {"name": "conv3_2_x2_zeropadding", "class_name": "ZeroPadding2D", "config": {"name": "conv3_2_x2_zeropadding", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["relu3_2_x2", 0, 0, {}]]]}, {"name": "conv3_2_x2", "class_name": "Conv2D", "config": {"name": "conv3_2_x2", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv3_2_x2_zeropadding", 0, 0, {}]]]}, {"name": "concat_3_2", "class_name": "Concatenate", "config": {"name": "concat_3_2", "trainable": true, "axis": 3}, "inbound_nodes": [[["concat_3_1", 0, 0, {}], ["conv3_2_x2", 0, 0, {}]]]}, {"name": "conv3_3_x1_bn", "class_name": "BatchNormalization", "config": {"name": "conv3_3_x1_bn", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 1.1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concat_3_2", 0, 0, {}]]]}, {"name": "conv3_3_x1_scale", "class_name": "Scale", "config": {"name": "conv3_3_x1_scale", "trainable": true, "momentum": 0.9, "axis": 3}, "inbound_nodes": [[["conv3_3_x1_bn", 0, 0, {}]]]}, {"name": "relu3_3_x1", "class_name": "Activation", "config": {"name": "relu3_3_x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv3_3_x1_scale", 0, 0, {}]]]}, {"name": "conv3_3_x1", "class_name": "Conv2D", "config": {"name": "conv3_3_x1", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["relu3_3_x1", 0, 0, {}]]]}, {"name": "conv3_3_x2_bn", "class_name": "BatchNormalization", "config": {"name": "conv3_3_x2_bn", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 1.1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3_3_x1", 0, 0, {}]]]}, {"name": "conv3_3_x2_scale", "class_name": "Scale", "config": {"name": "conv3_3_x2_scale", "trainable": true, "momentum": 0.9, "axis": 3}, "inbound_nodes": [[["conv3_3_x2_bn", 0, 0, {}]]]}, {"name": "relu3_3_x2", "class_name": "Activation", "config": {"name": "relu3_3_x2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv3_3_x2_scale", 0, 0, {}]]]}, {"name": "conv3_3_x2_zeropadding", "class_name": "ZeroPadding2D", "config": {"name": "conv3_3_x2_zeropadding", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["relu3_3_x2", 0, 0, {}]]]}, {"name": "conv3_3_x2", "class_name": "Conv2D", "config": {"name": "conv3_3_x2", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv3_3_x2_zeropadding", 0, 0, {}]]]}, {"name": "concat_3_3", "class_name": "Concatenate", "config": {"name": "concat_3_3", "trainable": true, "axis": 3}, "inbound_nodes": [[["concat_3_2", 0, 0, {}], ["conv3_3_x2", 0, 0, {}]]]}, {"name": "conv3_4_x1_bn", "class_name": "BatchNormalization", "config": {"name": "conv3_4_x1_bn", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 1.1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concat_3_3", 0, 0, {}]]]}, {"name": "conv3_4_x1_scale", "class_name": "Scale", "config": {"name": "conv3_4_x1_scale", "trainable": true, "momentum": 0.9, "axis": 3}, "inbound_nodes": [[["conv3_4_x1_bn", 0, 0, {}]]]}, {"name": "relu3_4_x1", "class_name": "Activation", "config": {"name": "relu3_4_x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv3_4_x1_scale", 0, 0, {}]]]}, {"name": "conv3_4_x1", "class_name": "Conv2D", "config": {"name": "conv3_4_x1", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["relu3_4_x1", 0, 0, {}]]]}, {"name": "conv3_4_x2_bn", "class_name": "BatchNormalization", "config": {"name": "conv3_4_x2_bn", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 1.1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3_4_x1", 0, 0, {}]]]}, {"name": "conv3_4_x2_scale", "class_name": "Scale", "config": {"name": "conv3_4_x2_scale", "trainable": true, "momentum": 0.9, "axis": 3}, "inbound_nodes": [[["conv3_4_x2_bn", 0, 0, {}]]]}, {"name": "relu3_4_x2", "class_name": "Activation", "config": {"name": "relu3_4_x2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv3_4_x2_scale", 0, 0, {}]]]}, {"name": "conv3_4_x2_zeropadding", "class_name": "ZeroPadding2D", "config": {"name": "conv3_4_x2_zeropadding", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["relu3_4_x2", 0, 0, {}]]]}, {"name": "conv3_4_x2", "class_name": "Conv2D", "config": {"name": "conv3_4_x2", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv3_4_x2_zeropadding", 0, 0, {}]]]}, {"name": "concat_3_4", "class_name": "Concatenate", "config": {"name": "concat_3_4", "trainable": true, "axis": 3}, "inbound_nodes": [[["concat_3_3", 0, 0, {}], ["conv3_4_x2", 0, 0, {}]]]}, {"name": "conv3_5_x1_bn", "class_name": "BatchNormalization", "config": {"name": "conv3_5_x1_bn", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 1.1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concat_3_4", 0, 0, {}]]]}, {"name": "conv3_5_x1_scale", "class_name": "Scale", "config": {"name": "conv3_5_x1_scale", "trainable": true, "momentum": 0.9, "axis": 3}, "inbound_nodes": [[["conv3_5_x1_bn", 0, 0, {}]]]}, {"name": "relu3_5_x1", "class_name": "Activation", "config": {"name": "relu3_5_x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv3_5_x1_scale", 0, 0, {}]]]}, {"name": "conv3_5_x1", "class_name": "Conv2D", "config": {"name": "conv3_5_x1", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["relu3_5_x1", 0, 0, {}]]]}, {"name": "conv3_5_x2_bn", "class_name": "BatchNormalization", "config": {"name": "conv3_5_x2_bn", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 1.1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3_5_x1", 0, 0, {}]]]}, {"name": "conv3_5_x2_scale", "class_name": "Scale", "config": {"name": "conv3_5_x2_scale", "trainable": true, "momentum": 0.9, "axis": 3}, "inbound_nodes": [[["conv3_5_x2_bn", 0, 0, {}]]]}, {"name": "relu3_5_x2", "class_name": "Activation", "config": {"name": "relu3_5_x2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv3_5_x2_scale", 0, 0, {}]]]}, {"name": "conv3_5_x2_zeropadding", "class_name": "ZeroPadding2D", "config": {"name": "conv3_5_x2_zeropadding", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["relu3_5_x2", 0, 0, {}]]]}, {"name": "conv3_5_x2", "class_name": "Conv2D", "config": {"name": "conv3_5_x2", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv3_5_x2_zeropadding", 0, 0, {}]]]}, {"name": "concat_3_5", "class_name": "Concatenate", "config": {"name": "concat_3_5", "trainable": true, "axis": 3}, "inbound_nodes": [[["concat_3_4", 0, 0, {}], ["conv3_5_x2", 0, 0, {}]]]}, {"name": "conv3_6_x1_bn", "class_name": "BatchNormalization", "config": {"name": "conv3_6_x1_bn", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 1.1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concat_3_5", 0, 0, {}]]]}, {"name": "conv3_6_x1_scale", "class_name": "Scale", "config": {"name": "conv3_6_x1_scale", "trainable": true, "momentum": 0.9, "axis": 3}, "inbound_nodes": [[["conv3_6_x1_bn", 0, 0, {}]]]}, {"name": "relu3_6_x1", "class_name": "Activation", "config": {"name": "relu3_6_x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv3_6_x1_scale", 0, 0, {}]]]}, {"name": "conv3_6_x1", "class_name": "Conv2D", "config": {"name": "conv3_6_x1", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["relu3_6_x1", 0, 0, {}]]]}, {"name": "conv3_6_x2_bn", "class_name": "BatchNormalization", "config": {"name": "conv3_6_x2_bn", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 1.1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3_6_x1", 0, 0, {}]]]}, {"name": "conv3_6_x2_scale", "class_name": "Scale", "config": {"name": "conv3_6_x2_scale", "trainable": true, "momentum": 0.9, "axis": 3}, "inbound_nodes": [[["conv3_6_x2_bn", 0, 0, {}]]]}, {"name": "relu3_6_x2", "class_name": "Activation", "config": {"name": "relu3_6_x2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv3_6_x2_scale", 0, 0, {}]]]}, {"name": "conv3_6_x2_zeropadding", "class_name": "ZeroPadding2D", "config": {"name": "conv3_6_x2_zeropadding", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["relu3_6_x2", 0, 0, {}]]]}, {"name": "conv3_6_x2", "class_name": "Conv2D", "config": {"name": "conv3_6_x2", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv3_6_x2_zeropadding", 0, 0, {}]]]}, {"name": "concat_3_6", "class_name": "Concatenate", "config": {"name": "concat_3_6", "trainable": true, "axis": 3}, "inbound_nodes": [[["concat_3_5", 0, 0, {}], ["conv3_6_x2", 0, 0, {}]]]}, {"name": "conv3_7_x1_bn", "class_name": "BatchNormalization", "config": {"name": "conv3_7_x1_bn", "trainable": true, "axis": 3, "momentum": 0.99, "epsilon": 1.1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concat_3_6", 0, 0, {}]]]}, {"name": "conv3_7_x1_scale", "class_name": "Scale", "config": {"name": "conv3_7_x1_scale", "trainable": true, "momentum": 0.9, "axis": 3}, "inbound_nodes": [[["conv3_7_x1_bn", 0, 0, {}]]]}, {"name": "relu3_7_x1", "class_name": "Activation", "config": {"name": "relu3_7_x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv3_7_x1_scale", 0, 0, {}]]]}, {"name": "conv3_7_x1", "class_name": "Conv2D", "config": {"name": "conv3_7_x1", 